uhnp/src/InformationRegisters/тн_ДополнительныеНастройкиПоОрганизациям/тн_ДополнительныеНастройкиПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ДополнительныеНастройкиПоОрганизациям</name>
  <comment>Выполнение задач №000047300</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>АвансовыйОтчет_ДатаУтверждения_Равна_ДатеДокумента</name>
    <comment>Выполнение задач №000052246</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БанковскийСчет_Эквайринга</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ВключитьАвтоустановкуПризнакаПрочиеОтношенияДляКонтрагентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаНачисленияАкцизов</name>
    <comment>Выполнение задач №000050329</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетаНаценкиЗавода_в_ЕРП</name>
    <comment>№000050775</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДоговорЗаписиКнигиПродажПодарки</name>
    <comment>//Сафиуллина З.Р. 26.04.2024 Выполнение задач №000049328</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорЗаписиКнигиПродажРеклама</name>
    <comment>//Сафиуллина З.Р. 26.04.2024 Выполнение задач №000049328</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорПеревыставленияЗатрат</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказДавальца_Склад</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказДавальца_СкладПоступления</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ЗаказДавальца2_5</name>
    <comment>Выполнение задач №000052183</comment>
    <type>
      <types>DocumentRef.ЗаказДавальца2_5</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретНаРучноеСоздание_СтатейРасходовИДоходов</name>
    <comment>Выполнение задач №000048311</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент_БанкЭквайер</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>КонтрагентПеревыставленияЗатрат</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаПоступленияДопРасходов_СтатьяРасходов</name>
    <comment>Выполнение задач №000049499</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>КорСтатьяАктивовПассивовМаркетинговыеПрограммы</name>
    <comment>// Юдина (Гутарова) Екатерина 16.10.2024 Выполнение задач №000051189	</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </resources>
  <resources>
    <name>КорСтатьяДоходовМаркетинговыеПрограммы</name>
    <comment>// Юдина (Гутарова) Екатерина 16.10.2024 Выполнение задач №000051189	</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>НДДляВнутреннегоПотребленияНаРекламуБлогерам</name>
    <comment>// Юдина Екатерина 05.08.2024 Выполнение задач №000050406</comment>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>НеВыгружатьРегистрыОСВЦБ</name>
    <comment>№000050614</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеФормироватьЗаписиРегистровОС</name>
    <comment>№000050614</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НоменклатураДавальческойСхемы</name>
    <comment>Выполнение задач №000048261</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>НоменклатураКомплектаПриВозвратеПоставщику</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ОбщехозяйственноеПодразделение</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ОтражениеЗарплатыВФинУчете_НеИспользоватьФизЛицоПодразделения</name>
    <comment>Выполнение задач №000048956</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПеремещениеОС_Счет79_СобытиеОС</name>
    <comment>Выполнение задач №000047318</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеДавальческойСхемы</name>
    <comment>Выполнение задач №000048261</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>РаспределениеВозвратныхОтходов_ПравилоРаспределения</name>
    <comment>Выполнение задач №000047662</comment>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СкладДавальческойСхемы</name>
    <comment>Выполнение задач №000048261</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>СкладДляСписанияНаРекламуБлогерам</name>
    <comment>// Юдина Екатерина 05.08.2024 Выполнение задач №000050406</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>СписаниеОС_Счет79_СобытиеОС</name>
    <comment>Выполнение задач №000047318</comment>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияВУчетеПоУмолчанию</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВБухУчете</types>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСЗаписиКнигиПродажРекламаПодарки</name>
    <comment>//Сафиуллина З.Р. 26.04.2024 Выполнение задач №000049328</comment>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДС_ВыплатаЗП</name>
    <comment>Выполнение задач №000048350</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДС_ПоступлениеОплатыПоПлатежнойКарте</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходов_ПроцентыПоЗаймамКПолучению</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ДляНачисленияСтраховогоФонда</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ЗемельныйНалог</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ИнвентаризацияНаРекламу</name>
    <comment>// Юдина Екатерина 28.11.2024 Выполнение задач №000051837</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_НалогНаИмущество</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ОбменаУслугСЗавода</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ПринятиеКУчетуОС</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ТранспортныйНалог</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ФормированиеСтоимостиНМА</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ЭлектронныеБилеты</name>
    <comment>Выполнение задач №000048304</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ФизЛицоВозвратаЗаработнойПлаты</name>
    <comment>Выполнение задач №000048893</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДоходов_НедостачиИПотериОтПорчиЦенностей</name>
    <comment>// Юдина Екатерина 03.03.2025 Выполнение задач №000052851</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяАктивовПассивовПоВидуНалогов</name>
    <comment>//Качикина 20.03.2025 Выполнение задач №000052890</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПереоценкаБУ</name>
    <comment>// Юдина Екатерина 14.05.2025 Выполнение задач №000053679</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ТЗР_Счет07</name>
    <comment>//Сафиуллина З.Р. 22.05.2025 Выполнение задач №000053655</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ГФУРасходыПоОбъектамСтроительства</name>
    <comment>//Качикина 26.05.2025 Выполнение задач №000053664</comment>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</types>
    </type>
  </resources>
  <resources>
    <name>РеклассификацияРасходов_АвтосозданиеПоУправленческойОрганизации</name>
    <comment>// Чекордина Ирина 05.06.2025 Выполнение задач №000053933</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидВзаиморасчетовПоРасшифровкеТУ</name>
    <comment>//Сафиуллина З.Р. 20.06.2025 Выполнение задач №000054153</comment>
    <type>
      <types>CatalogRef.тн_ВидыВзаиморасчетов</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПередачиВПереработку</name>
    <comment>//Блинова М.А. 23.09.2025 Выполнение задач №000055061</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСИзДокумента_ДеньгиВПути</name>
    <comment>// Белоконенко Денис 26.02.2026 Выполнение задач №000056660</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетАрендыВУУ</name>
    <comment>// Белоконенко Денис 08.12.2025 Выполнение задач №000055735</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов_ПоАренднымОбязательствам</name>
    <comment>// Белоконенко Денис 08.12.2025 Выполнение задач №000055735</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СворачиватьЗарплатуИВзносы</name>
    <comment>// Белоконенко Денис 21.01.2026 Выполнение задач №000055842</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СворачиватьНДФЛ</name>
    <comment>// Белоконенко Денис 21.01.2026 Выполнение задач №000055842</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СворачиватьУдержания</name>
    <comment>// Белоконенко Денис 21.01.2026 Выполнение задач №000055842</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗакрытиеГода_РазбиватьПоДокументам</name>
    <comment>// Чекордина Ирина 06.02.2026 Выполнение задач №000056617</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗакрытиеГода_КоличествоПроводокВДокументе</name>
    <comment>// Чекордина Ирина 06.02.2026 Выполнение задач №000056617</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодОтраженияПоДатеВыставленияСЧФ</name>
    <comment>//Блинова М.А. 10.02.2026 Выполнение задач №000056349</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодразделениеРеализацииРабот</name>
    <comment>// Белоконенко Денис 01.04.2026 Выполнение задач №000057017</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеРеализацииРабот</name>
    <comment>// Белоконенко Денис 01.04.2026 Выполнение задач №000057017</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорПередачиРасчетов_Счет7609</name>
    <comment>//Сафиуллина З.Р. 09.04.2026 Выполнение задач №000057135</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_ДополнительныеНастройкиПоОрганизациям/ManagerModule.bsl
//Урубков И. 04.09.2025 Выполнение задач №000054387
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//~ Урубков И. 04.09.2025 Выполнение задач №000054387 Добавлен обязательный параметр для обработчика с режимом выполнения "Отложенно"
////Сафиуллина З.Р. 03.07.2025 Выполнение задач №000054153
////
//Процедура ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг() Экспорт
Процедура ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг(Параметры = Неопределено) Экспорт
	
	ОрганизацияТНСС = Справочники.Организации.ПустаяСсылка(); 
	ВидВзаиморасчетовРасчетыСТЭК = Справочники.тн_ВидыВзаиморасчетов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.Код = &КодОрганизации
		|	И Организации.ИНН = &ИНН
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_ВидыВзаиморасчетов.Ссылка КАК ВидВзаиморасчета
		|ИЗ
		|	Справочник.тн_ВидыВзаиморасчетов КАК тн_ВидыВзаиморасчетов
		|ГДЕ
		|	тн_ВидыВзаиморасчетов.Код = &КодВидаВзаиморасчета
		|	И тн_ВидыВзаиморасчетов.Наименование = &НаименованиеВидаВзаиморасчета";
	
	Запрос.УстановитьПараметр("ИНН", "7702521529");
	Запрос.УстановитьПараметр("КодОрганизации", "000000001");
	Запрос.УстановитьПараметр("КодВидаВзаиморасчета", "00026");
	Запрос.УстановитьПараметр("НаименованиеВидаВзаиморасчета", "Расчеты с ТЭК");
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаОрганизация = Результат[0].Выбрать();
	Если ВыборкаОрганизация.Следующий() Тогда
		ОрганизацияТНСС = ВыборкаОрганизация.Организация; 
	КонецЕсли;
	
	ВыборкаВидВзаиморасчета = Результат[1].Выбрать();
	Если ВыборкаВидВзаиморасчета.Следующий() Тогда
		ВидВзаиморасчетовРасчетыСТЭК = ВыборкаВидВзаиморасчета.ВидВзаиморасчета; 
	КонецЕсли;
	
	ДанныеЗаполненияНайдены = ЗначениеЗаполнено(ОрганизацияТНСС) И ЗначениеЗаполнено(ВидВзаиморасчетовРасчетыСТЭК);
	Если НЕ ДанныеЗаполненияНайдены Тогда
		Если НЕ ЗначениеЗаполнено(ОрганизацияТНСС) Тогда
			ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям,,
				"Ошибка при выполнении обработчика обновления РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям.ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг: " 
				+ "Не найдена организация ""ТН-Строительные системы""");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ВидВзаиморасчетовРасчетыСТЭК) Тогда
			ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям,,
				"Ошибка при выполнении обработчика обновления РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям.ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг: " 
				+ "Не найден вид взаиморасчетов ""Расчеты с ТЭК""");
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_ДополнительныеНастройкиПоОрганизациямСрезПоследних.Период КАК Период,
		|	тн_ДополнительныеНастройкиПоОрганизациямСрезПоследних.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.тн_ДополнительныеНастройкиПоОрганизациям.СрезПоследних(, Организация = &ОрганизацияТНСС) КАК тн_ДополнительныеНастройкиПоОрганизациямСрезПоследних";
	
	Запрос.УстановитьПараметр("ОрганизацияТНСС", ОрганизацияТНСС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Запись = РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям.СоздатьМенеджерЗаписи();
		Запись.Организация = Выборка.Организация;
		Запись.Период = Выборка.Период;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда
			Запись.ВидВзаиморасчетовПоРасшифровкеТУ = ВидВзаиморасчетовРасчетыСТЭК;
		КонецЕсли;
		
		Попытка
	    	Запись.Записать(); 
		Исключение
	    	ЗаписьЖурналаРегистрации("Обновление информационной базы", УровеньЖурналаРегистрации.Ошибка, 
				Метаданные.РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям,,
				"Ошибка при выполнении обработчика обновления РегистрыСведений.тн_ДополнительныеНастройкиПоОрганизациям.ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг: " 
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры  //ДобавитьВидВзаиморасчетовПоРасшифровкеТранспортныхУслуг()

//Урубков И. 04.09.2025 Выполнение задач №000054387
#КонецЕсли
